// ConsoleApplication2.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//

#include <iostream>

//int a = 3, b = 4, c = 5, d = 9;
extern int a, b, c, d;

int x = 26;
float result1 (0.0f);
int result2;
const int compare = 21;
int diff;


int main()
{
    //task 1
    int a = 3, b = 4, c = 5, d = 9;
    result1 = a * (b + (static_cast <float>(c) / d)); 
    std::cout << result1 << "\n";
    
    //task 2
    diff = x - compare;
    result2 = (x <= compare) ? (diff) : (diff * 2);
    std::cout << result2 << "\n";

    //task 3



    //task 4
    result1 = ::a * (::b + (static_cast <float>(::c) / ::d));
    std::cout << result1 << "\n";


    return 0;
}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
