// ConsoleApplication1.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//Игра "Крестики-нолики"
//


#include <iostream>
// task 1
short int ScorePlayr1 = 0, ScorePlayr2 = 0;
int StepCount{ 0 };
long long a = 8765432;
char Round = 0, PlayrName1 [], PlayrName2[];
bool FlagComplete = false;
float MoveDuration{ 0.00f };
double GameDuration = 0.0f;

// task 2
enum Symbols {zero, cross, empty};

//task 3
Symbols GameAry[3][3];



int main()
{
    for (int i = 0; i < 3; i++)
    {
        for (int j = 0; j < 3; j++)
            std::cout << GameAry[i][j] << "\t";
        std::cout << "string" << '\n';
    }

    return 0;
}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
